Repository: junyu17/Maren
Catalog: Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko, zh_hant

source: 升级 Premium,查看近 30 天心情走势。
en: Upgrade to Premium to see your 30-day mood trend.
es: Mejora a Premium para ver tu tendencia de ánimo de 30 días.
ja: Premiumにアップグレードすると、直近30日間の気分の推移を確認できます。
ko: Premium으로 업그레이드하면 30일 기분 추이를 볼 수 있어요.
zh_hant: 升級 Premium,檢視近 30 天心情走勢。

source: 升级 Premium,查看追踪项出现频次。
en: Upgrade to Premium to see how often each tracker shows up.
es: Mejora a Premium para ver con qué frecuencia aparece cada seguimiento.
ja: Premiumにアップグレードすると、各トラッカーの出現頻度を確認できます。
ko: Premium으로 업그레이드하면 각 추적 항목이 나타난 빈도를 볼 수 있어요.
zh_hant: 升級 Premium,檢視追蹤項出現頻次。

source: 升级 Premium,自定义报告范围和内容
en: Upgrade to Premium to customize the report range and contents
es: Mejora a Premium para personalizar el rango y el contenido del informe
ja: Premiumにアップグレードすると、レポートの範囲と内容をカスタマイズできます
ko: Premium으로 업그레이드하면 리포트의 기간과 내용을 직접 정할 수 있어요
zh_hant: 升級 Premium,自定義報告範圍和內容

source: 升级后解锁更多洞察与趋势分析,全部在本机完成、不联网。
en: Upgrade to unlock more insights and trend analysis, all on-device, no internet required.
es: Mejora para desbloquear más información y análisis de tendencias, todo en el dispositivo y sin conexión a internet.
ja: アップグレードすると、さらに多くのインサイトと傾向分析がロック解除されます。すべて端末内で処理され、インターネット接続は不要です。
ko: 업그레이드하면 더 많은 인사이트와 추이 분석을 볼 수 있어요. 모두 기기 안에서 처리되며 인터넷이 필요 없어요.
zh_hant: 升級後解鎖更多洞察與趨勢分析,全部在本機完成、不聯網。

source: 升级查看周期详细均值与追踪项
en: Upgrade to see detailed cycle averages and trackers
es: Mejora para ver medias del ciclo y seguimientos en detalle
ja: アップグレードすると、周期の詳しい平均値とトラッカーを確認できます
ko: 업그레이드하면 주기별 평균과 추적 항목을 자세히 볼 수 있어요
zh_hant: 升級檢視週期詳細均值與追蹤項

source: 升级查看本周详细均值与对比
en: Upgrade to see detailed weekly averages and comparisons
es: Mejora para ver medias y comparaciones semanales en detalle
ja: アップグレードすると、週ごとの詳しい平均値と比較を確認できます
ko: 업그레이드하면 주간 평균과 비교를 자세히 볼 수 있어요
zh_hant: 升級檢視本週詳細均值與對比

source: 升级解锁
en: Unlock with Premium
es: Desbloquear con Premium
ja: Premiumでロック解除
ko: Premium으로 잠금 해제
zh_hant: 升級解鎖

source: 卵泡期
en: Follicular
es: Folicular
ja: 卵胞期
ko: 난포기

source: 历史周期
en: Cycle history
es: Historial de ciclos
ja: 周期の履歴
ko: 주기 기록
zh_hant: 歷史週期

source: 压力过大
en: Overwhelmed
es: Desbordada
ja: 手一杯
ko: 벅찬 기분
zh_hant: 壓力過大

source: 原始 CSV/PDF 导出不会加密,也不会设置密码。继续前请确认你会安全分享和存储这些文件。
en: Raw CSV/PDF exports are not encrypted or password-protected. Before continuing, confirm that you will share and store these files securely.
es: Las exportaciones CSV/PDF sin procesar no están cifradas ni protegidas con contraseña. Antes de continuar, confirma que compartirás y guardarás estos archivos de forma segura.
ja: CSV/PDFの生データはエクスポート時に暗号化されず、パスワードも設定されません。続行する前に、これらのファイルを安全に共有・保管することを確認してください。
ko: 원본 CSV/PDF 내보내기 파일은 암호화되거나 암호로 보호되지 않아요. 계속하기 전에 이 파일들을 안전하게 공유하고 보관할 수 있는지 확인하세요.
zh_hant: 原始 CSV/PDF 匯出不會加密,也不會設定密碼。繼續前請確認你會安全分享和儲存這些檔案。

source: 去系统设置开启通知
en: Open Settings to enable notifications
es: Abre Ajustes para activar las notificaciones
ja: 設定を開いて通知を有効にする
ko: 설정을 열어 알림을 켜세요
zh_hant: 去系統設定開啟通知

source: 双向同步经期:导入「健康」里已有的经期,并把你在 Maren 记的经期写回「健康」。数据仅在本机之间流转,不经过任何服务器。
en: Two-way period sync: import periods already in Health, and write the periods you log in Maren back to Health. Data only moves between apps on your device — never through a server.
es: Sincronización bidireccional del periodo: importa los periodos que ya están en Salud y devuelve a Salud los que registres en Maren. Los datos solo se mueven entre apps de tu dispositivo, nunca pasan por un servidor.
ja: 生理の双方向同期:「ヘルスケア」に既にある生理記録をインポートし、Marenで記録した生理を「ヘルスケア」に書き戻します。データはこの端末内のApp間でのみやり取りされ、サーバーを経由することはありません。
ko: 생리 양방향 동기화: 건강 앱에 이미 있는 생리 기록을 가져오고, Maren에서 기록한 생리를 건강 앱에 다시 써요. 데이터는 기기 안의 앱끼리만 오가며 서버를 거치지 않아요.
zh_hant: 雙向同步經期:匯入「健康」裡已有的經期,並把你在 Maren 記的經期寫回「健康」。資料僅在本機之間流轉,不經過任何伺服器。

source: 双向同步经期:导入「健康」里最近 180 天的经期记录(含其他 App 记的),并把你在 Maren 记的经期写回「健康」。数据仅在本机之间流转,不经过任何服务器;Maren 删除记录时只会删除本 App 写入的样本,不会动你在其他 App 的记录。
en: Two-way period sync: imports the last 180 days of period entries from Apple Health (including ones logged by other apps), and writes the periods you log in Maren back to Health. Data moves only between apps on this device — never through a server. When Maren deletes an entry it removes only the samples Maren wrote; entries from other apps are left untouched.
es: Sincronización bidireccional del periodo: importa los últimos 180 días de registros de periodo desde Salud de Apple (incluidos los de otras apps) y devuelve a Salud los periodos que registres en Maren. Los datos solo se mueven entre apps de este dispositivo, nunca pasan por un servidor. Cuando Maren elimina una entrada, solo borra las muestras que escribió Maren; las de otras apps no se tocan.
ja: 生理の双方向同期:「ヘルスケア」にある直近180日分の生理記録(他のAppで記録したものを含む)をインポートし、Marenで記録した生理を「ヘルスケア」に書き戻します。データはこの端末内のApp間でのみやり取りされ、サーバーを経由することはありません。Marenで記録を削除しても、Marenが書き込んだデータのみが削除され、他のAppの記録には影響しません。
ko: 생리 양방향 동기화: Apple 건강에서 최근 180일의 생리 기록(다른 앱에서 기록한 것 포함)을 가져오고, Maren에서 기록한 생리를 건강 앱에 다시 써요. 데이터는 이 기기의 앱끼리만 오가며 서버를 거치지 않아요. Maren에서 기록을 삭제해도 Maren이 쓴 샘플만 지워지고, 다른 앱의 기록은 그대로 유지돼요.
zh_hant: 雙向同步經期:匯入「健康」裡最近 180 天的經期記錄(含其他 App 記的),並把你在 Maren 記的經期寫回「健康」。資料僅在本機之間流轉,不經過任何伺服器;Maren 刪除記錄時只會刪除本 App 寫入的樣本,不會動你在其他 App 的記錄。

source: 取消
en: Cancel
es: Cancelar
ja: キャンセル
ko: 취소

source: 取消收藏
en: Remove bookmark
es: Quitar marcador
ja: ブックマークを解除
ko: 북마크 해제

source: 只读
en: Read-only
es: Solo lectura
ja: 読み取り専用
ko: 읽기 전용
zh_hant: 只讀

source: 可能已延后约 %lld 天
en: Possibly about %lld days late
es: Puede que lleve unos %lld días de retraso
ja: %lld日ほど遅れている可能性があります
ko: 약 %lld일 늦어졌을 수 있어요
zh_hant: 可能已延後約 %lld 天

source: 可能的记录间隔
en: Possible recording gap
es: Posible hueco en los registros
ja: 記録の抜けの可能性
ko: 기록이 빠졌을 수 있어요
zh_hant: 可能的記錄間隔

source: 可自定义日期范围与备注,生成结构化 PDF 供就诊分享。免费版固定近 6 个月范围。
en: Customize the date range and notes in a structured PDF for a clinician visit. The free version uses a fixed six-month range.
es: Personaliza el rango de fechas y las notas en un PDF estructurado para la consulta médica. La versión gratuita usa un rango fijo de seis meses.
ja: 日付範囲やメモをカスタマイズし、受診用に整理されたPDFを作成できます。無料版は直近6か月固定です。
ko: 진료 방문용 구조화된 PDF의 기간과 메모를 직접 정할 수 있어요. 무료 버전은 6개월로 고정돼요.
zh_hant: 可自定義日期範圍與備註,生成結構化 PDF 供就診分享。免費版固定近 6 個月範圍。

source: 可设多个时间点,并选择只在某些周几提醒。提醒在本机生成,不经过服务器。
en: Set multiple times and choose specific weekdays. Reminders are generated on-device, never via a server.
es: Configura varias horas y elige días concretos de la semana. Los recordatorios se generan en el dispositivo, nunca a través de un servidor.
ja: 複数の時間を設定し、特定の曜日だけ選ぶこともできます。リマインダーは端末内で生成され、サーバーを経由しません。
ko: 여러 시간을 설정하고 특정 요일을 고를 수 있어요. 알림은 기기 안에서 만들어지며 서버를 거치지 않아요.
zh_hant: 可設多個時間點,並選擇只在某些周幾提醒。提醒在本機生成,不經過伺服器。

source: 合并模式保留本机较新的日期记录,并保留已有的用药、自定义项和打卡键。
en: Merge mode keeps newer local dates and preserves existing medications, custom items, and check-in keys.
es: El modo combinar conserva las fechas locales más recientes y mantiene los medicamentos, elementos personalizados y claves de registro existentes.
ja: マージモードでは、より新しいローカルの日付記録を保持し、既存の薬・カスタム項目・チェックインのキーを維持します。
ko: 병합 모드에서는 더 최신의 로컬 날짜를 유지하고, 기존 복용약, 사용자 항목, 체크인 키도 그대로 보존해요.
zh_hant: 合併模式保留本機較新的日期記錄,並保留已有的用藥、自定義項和打卡鍵。

source: 合并（推荐）
en: Merge (Recommended)
es: Combinar (recomendado)
ja: マージ(推奨)
ko: 병합(추천)
zh_hant: 合併（推薦）

source: 同步
en: Sync
es: Sincronizar
ja: 同期
ko: 동기화

source: 名称
en: Name
es: Nombre
ja: 名前
ko: 이름
zh_hant: 名稱

source: 听音乐
en: Listening to music
es: Escuchar música
ja: 音楽を聴く
ko: 음악 감상
zh_hant: 聽音樂

source: 周
en: week
es: semana
ja: 週
ko: 주

source: 周期
en: Cycle
es: Ciclo
ko: 주기
zh_hant: 週期

source: 周期不规律
en: Irregular cycle
es: Ciclo irregular
ja: 不規則な周期
ko: 불규칙한 주기
zh_hant: 週期不規律

source: 周期偏短
en: Short cycle
es: Ciclo corto
ja: 短い周期
ko: 짧은 주기
zh_hant: 週期偏短

source: 周期内有 %lld 天记录(共 %lld 天)。
en: %1$lld recorded days in the cycle (of %2$lld days).
es: %1$lld días registrados en el ciclo (de %2$lld días).
ja: この周期では%2$lld日中%1$lld日を記録しました。
ko: 이 주기에서 기록한 날은 %1$lld일이에요(총 %2$lld일 중).
zh_hant: 週期內有 %lld 天記錄(共 %lld 天)。

source: 周期均值
en: Cycle average
es: Media del ciclo
ja: 周期の平均
ko: 주기 평균
zh_hant: 週期均值

source: 周期对比
en: Cycle comparison
es: Comparación de ciclos
ja: 周期の比較
ko: 주기 비교
zh_hant: 週期對比

source: 周期标准差:
en: Cycle std dev:
es: Desv. típica del ciclo:
ja: 周期の標準偏差:
ko: 주기 표준편차:
zh_hant: 週期標準差:

source: 周期标准差:%@
en: Cycle std dev: %@
es: Desv. típica del ciclo: %@
ja: 周期の標準偏差:%@
ko: 주기 표준편차: %@
zh_hant: 週期標準差:%@

source: 周期标准差:%@ 天 — %@
en: Cycle standard deviation: %@ days — %@
es: Desviación típica del ciclo: %@ días — %@
ja: 周期の標準偏差:%@日 — %@
ko: 주기 표준편차: %@일 — %@
zh_hant: 週期標準差:%@ 天 — %@

source: 周期概况
en: Cycle overview
es: Resumen del ciclo
ja: 周期の概要
ko: 주기 개요
zh_hant: 週期概況

source: 周期概览
en: Cycle overview
es: Vista general del ciclo
ja: 周期の概要
ko: 주기 개요
zh_hant: 週期概覽

source: 周期点滴出血
en: Cycle spotting
es: Manchado del ciclo
ja: 周期中の少量出血
ko: 주기 중 소량 출혈
zh_hant: 週期點滴出血

source: 周期节律
en: Cycle rhythm
es: Ritmo del ciclo
ja: 周期のリズム
ko: 주기 리듬
zh_hant: 週期節律

source: 周期规律度观察
en: Cycle regularity
es: Regularidad del ciclo
ja: 周期の規則性
ko: 주기 규칙성
zh_hant: 週期規律度觀察

source: 周期设置已保存,但刷新失败
en: Cycle settings saved, but refresh failed
es: Ajustes del ciclo guardados, pero falló la actualización
ja: 周期設定は保存されましたが、更新に失敗しました
ko: 주기 설정은 저장했지만 새로고침에 실패했어요
zh_hant: 週期設定已儲存,但重新整理失敗

source: 周期长度
en: Cycle length
es: Duración del ciclo
ja: 周期の長さ
ko: 주기 길이
zh_hant: 週期長度

source: 周期长度与体重
en: Cycle Length & Weight
es: Duración del ciclo y peso
ja: 周期の長さと体重
ko: 주기 길이와 체중
zh_hant: 週期長度與體重

source: 周期长度变化 %@%lld 天
en: Cycle length change %@%lld days
es: Cambio en la duración del ciclo %@%lld días
ja: 周期の長さの変化 %@%lld日
ko: 주기 길이 변화 %@%lld일
zh_hant: 週期長度變化 %@%lld 天

source: 周期阶段
en: Cycle phases
es: Fases del ciclo
ja: 周期のフェーズ
ko: 주기 단계
zh_hant: 週期階段

source: 周期预测
en: Cycle prediction
es: Predicción del ciclo
ja: 周期の予測
ko: 주기 예측
zh_hant: 週期預測

source: 嗜睡
en: Excessive sleepiness
es: Somnolencia excesiva
ja: 過度の眠気
ko: 과도한 졸림

source: 四、每日记录摘要
en: 4. Daily Log Summary
es: 4. Resumen del registro diario
ja: 4. 日次記録の概要
ko: 4. 일일 기록 요약
zh_hant: 四、每日記錄摘要

source: 回顾
en: Review
es: Repaso
ja: レビュー
ko: 돌아보기
zh_hant: 回顧

source: 回顾数据基于你本机记录,为统计趋势洞察,不构成医学建议。
en: Review data is based on your on-device records and provides statistical trend insights, not medical advice.
es: Los datos del repaso se basan en tus registros del dispositivo y ofrecen observaciones estadísticas de tendencia, no consejo médico.
ja: レビューデータは端末内の記録に基づいており、統計的な傾向のインサイトを提供するものです。医学的な助言ではありません。
ko: 돌아보기 데이터는 기기에 저장된 내 기록을 바탕으로 한 통계적 추이 인사이트이며, 의학적 조언이 아니에요.
zh_hant: 回顧資料基於你本機記錄,為統計趨勢洞察,不構成醫學建議。

source: 困倦
en: Drowsiness
es: Somnolencia
ja: 眠気
ko: 졸림
zh_hant: 睏倦

source: 围绝经期
en: Perimenopause
es: Perimenopausia
ja: 更年期
ko: 폐경 전후
zh_hant: 圍絕經期

source: 图标
en: Icon
es: Icono
ja: アイコン
ko: 아이콘
zh_hant: 圖示

source: 在 %lld 个%@日中,心情平均 %@ / 5。
en: Across %lld %@ days, average mood was %@ / 5.
es: En %lld días de %@, el ánimo medio fue %@ / 5.
ja: %lld日間の%@の平均気分は%@ / 5でした。
ko: %@ %lld일 동안의 평균 기분은 5점 만점에 %@점이에요.
zh_hant: 在 %lld 個%@日中,心情平均 %@ / 5。

source: 在「日历」标记经期,在「今天」记录心情、症状、体重和用药,任何你想追踪的都能自己加。开始建立属于你的记录吧。
en: Mark periods on Calendar; log mood, symptoms, weight, and meds on Today — and add a tracker for anything else you want to follow. Start building your own record.
es: Marca los periodos en el Calendario; registra ánimo, síntomas, peso y medicación en Hoy, y añade un seguimiento para cualquier otra cosa que quieras vigilar. Empieza a construir tu propio historial.
ja: 「カレンダー」で生理を記録し、「今日」で気分・症状・体重・服薬を記録。追跡したいものは何でも自分で追加できます。あなただけの記録を始めましょう。
ko: 캘린더에서 생리를 표시하고, 오늘 탭에서 기분·증상·체중·복용약을 기록해 보세요. 그 밖에 따라가고 싶은 것은 추적 항목으로 추가할 수 있어요. 나만의 기록을 쌓아 보세요.
zh_hant: 在「日曆」標記經期,在「今天」記錄心情、症狀、體重和用藥,任何你想追蹤的都能自己加。開始建立屬於你的記錄吧。

source: 在「日历」标记经期,在「今天」记录心情、症状、体重和用药。开始建立属于你的记录吧。
en: Mark periods on Calendar; log mood, symptoms, weight, and meds on Today. Start building your own record.
es: Marca los periodos en el Calendario; registra ánimo, síntomas, peso y medicación en Hoy. Empieza a construir tu propio historial.
ja: 「カレンダー」で生理を記録し、「今日」で気分・症状・体重・服薬を記録。あなただけの記録を始めましょう。
ko: 캘린더에서 생리를 표시하고, 오늘 탭에서 기분·증상·체중·복용약을 기록해 보세요. 나만의 기록을 쌓아 보세요.
zh_hant: 在「日曆」標記經期,在「今天」記錄心情、症狀、體重和用藥。開始建立屬於你的記錄吧。

source: 在今天页记录心情、睡眠、症状或经期，Maren 会为你生成个性化的今日状态。
en: Record mood, sleep, symptoms, or your period on Today, and Maren will generate a personalized status for today.
es: Registra ánimo, sueño, síntomas o tu periodo en Hoy y Maren generará un estado personalizado para hoy.
ja: 「今日」ページで気分・睡眠・症状・生理を記録すると、Marenがあなた専用の今日の状態を作成します。
ko: 오늘 탭에서 기분, 수면, 증상, 생리를 기록하면 Maren이 오늘의 맞춤 상태를 만들어 드려요.
zh_hant: 在今天頁記錄心情、睡眠、症狀或經期，Maren 會為你生成個性化的今日狀態。

source: 在预测经期前 %@ 天提醒你。
en: Reminds you %@ days before your predicted period.
es: Te avisa %@ días antes de tu periodo previsto.
ja: 予測された生理の%@日前にお知らせします。
ko: 예상 생리일 %@일 전에 알려 드려요.
zh_hant: 在預測經期前 %@ 天提醒你。

source: 在预测经期前 %lld 天提醒你。
en: Reminds you %lld days before your predicted period.
es: Te avisa %lld días antes de tu periodo previsto.
ja: 予測された生理の%lld日前にお知らせします。
ko: 예상 생리일 %lld일 전에 알려 드려요.
zh_hant: 在預測經期前 %lld 天提醒你。

source: 在预测经期前 2 天提醒你(需要先记录出足够的周期)。
en: Reminds you 2 days before your predicted period (needs enough logged cycles first).
es: Te avisa 2 días antes de tu periodo previsto (antes necesitas suficientes ciclos registrados).
ja: 予測された生理の2日前にお知らせします(事前に十分な周期記録が必要です)。
ko: 예상 생리일 2일 전에 알려 드려요(먼저 충분한 주기 기록이 필요해요).
zh_hant: 在預測經期前 2 天提醒你(需要先記錄出足夠的週期)。

source: 在预测经期前 2 天提醒你。升级 Premium 可自定义 1–5 天。
en: Reminds you 2 days before your predicted period. Upgrade to Premium to customize 1–5 days.
es: Te avisa 2 días antes de tu periodo previsto. Mejora a Premium para elegir de 1 a 5 días.
ja: 予測された生理の2日前にお知らせします。Premiumにアップグレードすると1〜5日の範囲でカスタマイズできます。
ko: 예상 생리일 2일 전에 알려 드려요. Premium으로 업그레이드하면 1~5일 중에서 정할 수 있어요.
zh_hant: 在預測經期前 2 天提醒你。升級 Premium 可自定義 1–5 天。

source: 均由你的记录在本机计算,不联网、不外传。
en: All computed on-device from your records — never sent anywhere.
es: Todo se calcula en el dispositivo a partir de tus registros; nunca se envía a ninguna parte.
ja: すべてあなたの記録から端末内で計算され、どこにも送信されません。
ko: 모든 계산은 내 기록을 바탕으로 기기 안에서 이뤄지며, 어디로도 전송되지 않아요.
zh_hant: 均由你的記錄在本機計算,不聯網、不外傳。

source: 基于 %lld 个历史周期对比。
en: Compared against %lld historical cycles.
es: Comparado con %lld ciclos del historial.
ja: 過去の%lld周期と比較しています。
ko: 이전 주기 %lld회와 비교했어요.
zh_hant: 基於 %lld 個歷史週期對比。

source: 基于你的真实记录自适应估算,仅供参考,不代表排卵或避孕判断。
en: Adaptively estimated from your own records. For reference only — not a prediction of ovulation or contraception.
es: Estimado de forma adaptativa a partir de tus propios registros. Solo orientativo: no predice la ovulación ni sirve como anticonceptivo.
ja: あなた自身の記録に基づいて適応的に推定したものです。参考情報にすぎず、排卵や避妊の判断材料にはなりません。
ko: 내 기록을 바탕으로 적응형으로 추정한 값이에요. 참고용이며 배란 예측이나 피임을 위한 것이 아니에요.
zh_hant: 基於你的真實記錄自適應估算,僅供參考,不代表排卵或避孕判斷。

source: 基本一致
en: Broadly similar
es: En general parecido
ja: ほぼ同程度
ko: 대체로 비슷해요

source: 基础体温
en: Basal body temperature
es: Temperatura basal
ja: 基礎体温
ko: 기초체온
zh_hant: 基礎體溫

source: 基础体温 %@ °C
en: Basal body temperature %@ °C
es: Temperatura basal %@ °C
ja: 基礎体温 %@ °C
ko: 기초체온 %@°C
zh_hant: 基礎體溫 %@ °C

source: 基础体温 %lf °C
en: Basal body temperature %lf °C
es: Temperatura basal %lf °C
ja: 基礎体温 %lf °C
ko: 기초체온 %lf°C
zh_hant: 基礎體溫 %lf °C

source: 基础体温趋势
en: Basal body temperature trend
es: Tendencia de la temperatura basal
ja: 基礎体温の推移
ko: 기초체온 추이
zh_hant: 基礎體溫趨勢

source: 基础提醒通知
en: Basic reminders
es: Recordatorios básicos
ja: 基本のリマインダー
ko: 기본 알림
zh_hant: 基礎提醒通知

source: 基线
en: Baseline
es: Referencia
ja: 基準値
ko: 기준선
zh_hant: 基線

source: 墨蓝
en: Ink
es: Tinta
ja: インク
ko: 먹색
zh_hant: 墨藍

source: 处理中…
en: Processing…
es: Procesando…
ja: 処理中…
ko: 처리 중…
zh_hant: 處理中…

source: 备份中的用药打卡缺少对应的用药记录,未导入任何数据。
en: Medication check-ins in the backup have no matching medication; no data was imported.
es: Los registros de medicación de la copia de seguridad no tienen medicamento asociado; no se importó ningún dato.
ja: バックアップ内の服薬チェックインに対応する薬が見つからないため、データはインポートされませんでした。
ko: 백업의 복용 체크인에 일치하는 복용약이 없어서 아무 데이터도 가져오지 않았어요.
zh_hant: 備份中的用藥打卡缺少對應的用藥記錄,未匯入任何資料。

source: 备份中的记录格式无效,未导入任何数据。
en: The record format in the backup is invalid; no data was imported.
es: El formato de los registros de la copia de seguridad no es válido; no se importó ningún dato.
ja: バックアップ内の記録形式が無効なため、データはインポートされませんでした。
ko: 백업의 기록 형식이 올바르지 않아서 아무 데이터도 가져오지 않았어요.
zh_hant: 備份中的記錄格式無效,未匯入任何資料。

source: 备份保存失败,本机原有记录未改动。
en: The backup could not be saved; existing local data was unchanged.
es: No se pudo guardar la copia de seguridad; los datos locales no han cambiado.
ja: バックアップを保存できませんでした。既存のローカルデータは変更されていません。
ko: 백업을 저장하지 못했어요. 기존 로컬 데이터는 바뀌지 않았어요.
zh_hant: 備份儲存失敗,本機原有記錄未改動。

source: 备份加密配置无效,请更新 Maren 后重试。
en: The backup encryption configuration is invalid. Update Maren and try again.
es: La configuración de cifrado de la copia de seguridad no es válida. Actualiza Maren e inténtalo de nuevo.
ja: バックアップの暗号化設定が無効です。Marenを更新してから、もう一度お試しください。
ko: 백업 암호화 설정이 올바르지 않아요. Maren을 업데이트한 후 다시 시도해 주세요.
zh_hant: 備份加密配置無效,請更新 Maren 後重試。

source: 备份包含本机记录和少量可迁移偏好,使用密码加密后保存在你选择的位置。密码无法恢复,请妥善保管。
en: The backup includes local records and a small set of transferable preferences. It is encrypted with a password and saved where you choose. The password cannot be recovered; keep it safe.
es: La copia de seguridad incluye tus registros locales y un pequeño conjunto de preferencias transferibles. Se cifra con una contraseña y se guarda donde tú elijas. La contraseña no se puede recuperar; guárdala bien.
ja: バックアップには、ローカルの記録と一部の移行可能な設定が含まれます。パスワードで暗号化され、選択した場所に保存されます。パスワードは復元できないため、大切に保管してください。
ko: 백업에는 로컬 기록과 옮길 수 있는 일부 설정이 포함돼요. 암호로 암호화되어 직접 고른 위치에 저장돼요. 암호는 복구할 수 없으니 안전하게 보관하세요.
zh_hant: 備份包含本機記錄和少量可遷移偏好,使用密碼加密後儲存在你選擇的位置。密碼無法恢復,請妥善保管。

source: 备份密码
en: Backup password
es: Contraseña de la copia de seguridad
ja: バックアップパスワード
ko: 백업 암호
zh_hant: 備份密碼

source: 备份密码至少需要 8 个字符。
en: The backup password must be at least 8 characters.
es: La contraseña de la copia de seguridad debe tener al menos 8 caracteres.
ja: バックアップパスワードは8文字以上で入力してください。
ko: 백업 암호는 8자 이상이어야 해요.
zh_hant: 備份密碼至少需要 8 個字元。

source: 备份操作失败
en: Backup operation failed
es: Error en la copia de seguridad
ja: バックアップ操作に失敗しました
ko: 백업 작업 실패
zh_hant: 備份操作失敗

source: 备份操作未完成,本机数据未改动。请重试。
en: The backup operation did not finish; local data was unchanged. Please try again.
es: La copia de seguridad no se completó; los datos locales no han cambiado. Inténtalo de nuevo.
ja: バックアップ操作が完了しませんでした。ローカルデータは変更されていません。もう一度お試しください。
ko: 백업 작업이 끝나지 않았어요. 로컬 데이터는 바뀌지 않았으니 다시 시도해 주세요.
zh_hant: 備份操作未完成,本機資料未改動。請重試。

source: 备份文件超过 Maren 支持的大小上限。
en: The backup file exceeds Maren’s supported size limit.
es: El archivo de copia de seguridad supera el tamaño máximo que admite Maren.
ja: バックアップファイルがMarenのサポートするサイズの上限を超えています。
ko: 백업 파일이 Maren이 지원하는 크기 한도를 넘어요.
zh_hant: 備份檔案超過 Maren 支援的大小上限。

source: 备份预览
en: Backup preview
es: Vista previa de la copia de seguridad
ja: バックアップのプレビュー
ko: 백업 미리보기
zh_hant: 備份預覽

source: 备注
en: Notes
es: Notas
ja: メモ
ko: 메모
zh_hant: 備註

source: 外观
en: Appearance
es: Apariencia
ja: 外観
ko: 화면 스타일
zh_hant: 外觀

source: 外部数据更新
en: External data updated
es: Datos externos actualizados
ja: 外部データが更新されました
ko: 외부 데이터가 업데이트됐어요
zh_hant: 外部資料更新

source: 多休息、注意保暖
en: Rest more, stay warm
es: Descansa más y abrígate
ja: しっかり休んで、体を温めましょう
ko: 푹 쉬고 따뜻하게 지내세요

source: 多时段用药、经期提前天数自定义、PMS 关怀、按阶段智能提醒。
en: Multi-time medication reminders, custom period lead days, PMS self-care, smart phase-based reminders.
es: Recordatorios de medicación a varias horas, días de aviso del periodo personalizables, autocuidado del SPM y recordatorios inteligentes según la fase.
ja: 複数の時間帯での服薬リマインダー、生理予告日数のカスタマイズ、PMSケア、フェーズに応じたスマートリマインダー。
ko: 여러 시간대 복용약 알림, 생리 며칠 전 알림 설정, PMS 셀프케어, 주기 단계별 스마트 알림.
zh_hant: 多時段用藥、經期提前天數自定義、PMS 關懷、按階段智慧提醒。

source: 多时段用药提醒
en: Multi-time medication reminders
es: Recordatorios de medicación a varias horas
ja: 複数の時間帯での服薬リマインダー
ko: 여러 시간대 복용약 알림
zh_hant: 多時段用藥提醒

source: 多时段用药提醒、经期提前天数自定义、PMS 关怀、按阶段智能提醒--更懂你的节奏。
en: Multi-time medication reminders, custom period lead days, PMS self-care, and smart phase-based reminders — in tune with your rhythm.
es: Recordatorios de medicación a varias horas, días de aviso del periodo personalizables, autocuidado del SPM y recordatorios inteligentes según la fase: al ritmo de tu cuerpo.
ja: 複数の時間帯での服薬リマインダー、生理予告日数のカスタマイズ、PMSケア、フェーズに応じたスマートリマインダー。あなたのリズムに寄り添います。
ko: 여러 시간대 복용약 알림, 생리 며칠 전 알림 설정, PMS 셀프케어, 주기 단계별 스마트 알림으로 내 리듬에 맞춰 드려요.
zh_hant: 多時段用藥提醒、經期提前天數自定義、PMS 關懷、按階段智慧提醒--更懂你的節奏。

source: 多梦
en: Vivid dreams
es: Sueños vívidos
ja: 鮮明な夢
ko: 생생한 꿈
zh_hant: 多夢

source: 多毛
en: Excess hair
es: Exceso de vello
ko: 다모

source: 多记几天,就能看到你的规律
en: Log a few more days to see your patterns
es: Registra unos días más para ver tus patrones
ja: もう数日記録すると、あなたのパターンが見えてきます
ko: 며칠 더 기록하면 패턴을 볼 수 있어요
zh_hant: 多記幾天,就能看到你的規律

source: 多记几天,这里会出现属于你的洞察。
en: Log a few more days and your personal insights will appear here.
es: Registra unos días más y aquí aparecerá tu análisis personalizado.
ja: もう数日記録すると、ここにあなた専用のインサイトが表示されます。
ko: 며칠 더 기록하면 나만의 인사이트가 여기에 나타나요.
zh_hant: 多記幾天,這裡會出現屬於你的洞察。

source: 多记几天心情后显示。
en: Shown after a few more mood entries.
es: Se mostrará cuando registres algunos ánimos más.
ja: 気分の記録があと少し増えると表示されます。
ko: 기분을 몇 번 더 기록하면 표시돼요.
zh_hant: 多記幾天心情後顯示。

source: 夜间精力充沛
en: Nighttime energy
es: Energía por la noche
ja: 夜間のエネルギー
ko: 밤 시간대 에너지
zh_hant: 夜間精力充沛

source: 大量
en: Heavy
es: Abundante
ja: 多い
ko: 많음

source: 天(范围
en: days (range
es: días (rango
ja: 日(範囲
ko: 일(범위
zh_hant: 天(範圍

source: 天(范围 %@–%@ 天)
en: days (range %@–%@ days)
es: días (rango %@–%@ días)
ja: 日(範囲 %@〜%@日)
ko: 일(범위 %@–%@일)
zh_hant: 天(範圍 %@–%@ 天)

source: 天数
en: Days
es: Días
ja: 日数
ko: 일수
zh_hant: 天數

source: 失眠
en: Insomnia
es: Insomnio
ja: 不眠
ko: 불면

source: 头发变稀
en: Hair thinning
es: Pérdida de densidad capilar
ja: 薄毛
ko: 모발 가늘어짐
zh_hant: 頭髮變稀

source: 头晕
en: Dizziness
es: Mareo
ja: めまい
ko: 어지러움
zh_hant: 頭暈

source: 头痛
en: Headache
es: Dolor de cabeza
ja: 頭痛
ko: 두통
zh_hant: 頭痛

source: 好
en: OK
es: Aceptar
ja: OK
ko: 좋음

source: 如果你有 PCOS 或周期本来就不规律,很多主流 app 的「第 14 天排卵」假设会让预测很不准。Maren 只学习你自己的真实记录,支持 15–120 天的长周期,并如实呈现波动范围,而不是假装精准。
en: If you have PCOS or naturally irregular cycles, the “ovulation on day 14” assumption in many apps makes predictions unreliable. Maren only learns from your own records, supports long cycles of 15–120 days, and shows the real range of variation instead of pretending to be precise.
es: Si tienes SOP o ciclos irregulares por naturaleza, el supuesto de «ovulación el día 14» que usan muchas apps hace que las predicciones no sean fiables. Maren aprende solo de tus propios registros, admite ciclos largos de 15 a 120 días y muestra el rango real de variación en lugar de fingir precisión.
ja: PCOSや、もともと不規則な周期をお持ちの場合、多くの主要アプリが採用する「14日目に排卵」という前提は、予測の精度を大きく下げてしまいます。Marenはあなた自身の実際の記録だけから学習し、15〜120日という長い周期にも対応し、正確を装うのではなく実際の変動幅をそのまま示します。
ko: PCOS가 있거나 원래 주기가 불규칙하다면, 많은 앱이 쓰는 '배란은 14일째'라는 가정 때문에 예측이 맞지 않을 수 있어요. Maren은 내 기록만 보고 학습하고, 15~120일의 긴 주기도 지원하며, 정확한 척하는 대신 실제로 달라지는 범위를 보여 드려요.
zh_hant: 如果你有 PCOS 或週期本來就不規律,很多主流 app 的「第 14 天排卵」假設會讓預測很不準。Maren 只學習你自己的真實記錄,支援 15–120 天的長週期,並如實呈現波動範圍,而不是假裝精準。

source: 如果在服用二甲双胍、肌醇或其他补剂,可以在「设置 · 用药与补剂」里添加并开启每日提醒,方便坚持和复盘。
en: If you take Metformin, Inositol, or other supplements, add them under Settings › Medications & supplements and turn on a daily reminder to help you stay consistent.
es: Si tomas metformina, inositol u otros suplementos, añádelos en Ajustes › Medicación y suplementos y activa un recordatorio diario para no saltarte ninguna toma.
ja: メトホルミン、イノシトール、その他のサプリメントを服用している場合は、「設定・服薬とサプリメント」から追加し、毎日のリマインダーをオンにすると続けやすくなります。
ko: 메트포르민, 이노시톨 같은 영양제를 복용한다면 설정 › 복용약·영양제에서 추가하고 매일 알림을 켜서 꾸준히 챙겨 보세요.
zh_hant: 如果在服用二甲雙胍、肌醇或其他補劑,可以在「設定 · 用藥與補劑」裡新增並開啟每日提醒,方便堅持和復盤。

source: 妊娠纹
en: Stretch marks
es: Estrías
ja: 妊娠線
ko: 튼살
zh_hant: 妊娠紋

source: 完成
en: Done
es: Hecho
ja: 完了
ko: 완료

source: 完成周期
en: Completed cycle
es: Ciclo completado
ja: 完了した周期
ko: 끝난 주기

source: 完成周期回顾
en: Completed cycle review
es: Repaso del ciclo completado
ja: 完了周期のレビュー
ko: 끝난 주기 돌아보기
zh_hant: 完成周期回顧
